Revit 2024 API
PDFExportOptions.ReplaceHalftoneWithThinLines Property
 Whether to replace halftone with thin lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool ReplaceHalftoneWithThinLines { get; set; }
Visual Basic
Public Property ReplaceHalftoneWithThinLines As Boolean
	Get
	Set
Visual C++
public:
property bool ReplaceHalftoneWithThinLines {
	bool get ();
	void set (bool value);
}
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace